Validation/2D-filmBoiling/deltaT10/0/T.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T.org;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 646;

boundaryField
{
    up
    {
      type            zeroGradient;
    }
    walls
    {
        type            symmetryPlane;
    }
    down
    {
        type            fixedValue;
        value          uniform 656;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
