Validation/2D-filmBoiling/deltaT10/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.00115; // lc2d/2= 0.0023003957÷2

vertices        
(
    (0 0 0)
    (1 0 0)
    (1 2 0)
    (0 2 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 2 0.1)
    (0 2 0.1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (120 240 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch up 
    (
        (3 7 6 2)
    )

   symmetryPlane walls
   (
        (0 4 7 3)
        (2 6 5 1)
    ) 

    patch down 
    (
        (1 5 4 0)
    )

    empty frontAndBack 
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
