Validation/2D-filmBoiling/deltaT10/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application                interPhaseChangeFoam;

startFrom                  latestTime;

startTime                  0;

stopAt                     endTime;

endTime                    1;

deltaT                     1e-08;

writeControl               adjustableRunTime;

writeInterval              0.02;

purgeWrite                 0;

writeFormat                ascii;

writePrecision             8;

writeCompression           compressed;

timeFormat                 general;

runTimeModifiable          yes;

adjustTimeStep             on;

maxCo                      0.1;
maxAlphaCo      	   0.1;

maxDeltaT       0.1;

libs (
    "libOpenFOAM.so" // keeps paraFoam happy
    "libsimpleSwakFunctionObjects.so"  
);

functions
(

NuLocal
{
type swakExpression;
valueType patch;
patchName down;
verbose true;
variables (
	"Tsat=646;"
	"L=0.0002113791;" // L charestric length = sqrt (sigma/(g*(rohL-rhog))) =0.0002113791
	);
expression "L*snGrad(T)/(T-Tsat)";
accumulations (
        min
	max
        average
	);
}

); 

// ************************************************************************* //
